Основные_объекты_Занятие_6/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Неприкасаемые</name>
      <description>Неприкасаемые</description>
    </items>
    <items>
      <name>Принятые</name>
      <description>Принятые</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяКнижка</name>
    <attributes>
      <name>МестоРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Основные_объекты_Занятие_6/src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Женский</name>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
</mdclass:Enum>

Основные_объекты_Занятие_6/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	//ДЗ 1.3.2

	СобратьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)

	//ДЗ 1.3.2
	СобратьФИО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)

	//ДЗ 1.3.2
	СобратьФИО();
	
	//ДЗ 1.5.2
	УстановитьПолСотрудника();
	ОформитьПолеПолСотрудника();
	
КонецПроцедуры

&НаКлиенте
Процедура СобратьФИО()
	
	//ДЗ 1.3.2
	Объект.Наименование = Фамилия + " " + Имя + " " + Отчество;
	
	Заголовок = "Карточка сотрудника " + Объект.Наименование;

КонецПроцедуры // СобратьФИО()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ДЗ 1.3.2
	ЧастиФИО = ОбщийМодульНаСервереМожноВызватьСКлиента.ПолучитьЧастиФИО(Объект.Наименование);
	
	Фамилия = ЧастиФИО.Фамилия;
	Имя = ЧастиФИО.Имя;
	Отчество = ЧастиФИО.Отчество;

	ОформитьПолеПолСотрудника();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьПолСотрудника()
	
	ПоследняяБукваОтчетства = НРег(Прав(СокрЛП(Объект.Наименование),1));
	
	Если ПоследняяБукваОтчетства = "ч" Тогда
		
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Мужской");
		
	ИначеЕсли ПоследняяБукваОтчетства = "а" Тогда
		
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Женский");
		
	Иначе
		
		Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.ПустаяСсылка");
		
	КонецЕсли; 

КонецПроцедуры // УстановитьПолСотрудника()

&НаКлиенте
Процедура ОформитьПолеПолСотрудника()

	Если Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Женский") Тогда
		
		Элементы.Пол.ЦветФона = WebЦвета.Розовый;
		
	ИначеЕсли Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Мужской") Тогда
		
		Элементы.Пол.ЦветФона = WebЦвета.Голубой;
		
	ИНаче	
		
		Элементы.Пол.ЦветФона = WebЦвета.Оранжевый;
		
	КонецЕсли;

КонецПроцедуры // ОформитьПолеПолСотрудника()


&НаКлиенте
Процедура ЗагрузитьФотоИзФайла(Команда)
	
	НачатьПомещениеФайла(
	Новый ОписаниеОповещения("ЗагрузитьФотоИзФайлаЗавершение", ЭтотОбъект)
	,,,Истина,УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФотоИзФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
	
		 ФотоСотрудника = Адрес;
	
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЭтоАдресВременногоХранилища(ФотоСотрудника) Тогда
		
		Фото = ПолучитьИзВременногоХранилища(ФотоСотрудника);
	
		ТекущийОбъект.Фото = Новый ХранилищеЗначения(Фото);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЭтоАдресВременногоХранилища(ФотоСотрудника) Тогда
		
		УдалитьИзВременногоХранилища(ФотоСотрудника);
		
		ФотоСотрудника = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка,"Фото");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ФотоСотрудника = ПолучитьНавигационнуюСсылку(ТекущийОбъект.Ссылка,"Фото");
	
КонецПроцедуры
